#include <windows.h>

#include "statement.h"

//  Use GBK coding.

int TEMP = 0;

/*	模型
plotInitial(1,0,0,0);
plotValueAnalysis(&TEMP);
if (TEMP == 1){
}else if (TEMP == 2){
}else if (TEMP == 3){
}
*/

/*	"0000"
        第一个0暂无意义
        第二个0代表"0号资料片"
        第三个0代表章节
        第四个0代表章节节点
*/
// EP0_01-----
void EP0_friend011(void) {
  dataFile("0011");
  system("cls");
  _logEvent_("function.EP0_friend011() : user game start");

  Sleep_puts_("第一章:Friend\n", 5000);

  // 第一节点
  _Repeatedly_puts_(
      3000, 2, "",
      "-和平年代,没有大战,只有拉帮结派的民间纠纷.这个世界容不下那么多人,"
      "也不能死去那么多人,上一次大战导致同类绝大多数死亡.",
      "-不能失去那么多了...\n");
  _Repeatedly_puts_(2000, 1, "||我是山葵山野,大家叫我山野就好了",
                    "大家议论着我,因为我是新转来的学生吗?",
                    "我的心跳得砰砰响,这是我第一次在上学.");
  _Repeatedly_puts_(4000, 1,
                    "几年前的历史书上写着:战争频发,没有力量发展教育事业."
                    "50年教育筑固,被第四次大战毁的一干二净.",
                    "课余时间,同学出去玩耍,他们欢快的叫声让我很放松,"
                    "我翻阅着历史书,无数战争的画面在我脑里重现,我讨厌争...",
                    "直到看到了历史某一页有我的名字,有一瞬间我很失措,"
                    "为什么要把我的名字写在上面?");
  _Repeatedly_puts_(2000, 1, "想了想...",
                    "我想起我当时周围的一队战友,一同上阵,一人回来."
                    "心里有着不同想法,说不出的感觉...",
                    "有人拍了拍我的肩膀.");
  _Repeatedly_puts_(2000, 1, "||是忠胜啊,你也在这个班级,真是幸运...",
                    "忠胜:是我要求老师和你一班...",
                    "忠胜:带你去认识一下学校吧...顺便一路上和你谈谈事情.");
  _Repeatedly_puts_(4000, 1, "一路上,他介绍了很多...",
                    "我喜欢这个感觉,慢走在校园,阳光洒在脸上很温暖,"
                    "我俩坐在一条长椅上,树梢轻轻抚摸着我们的后背,他低头沉思...",
                    "他的样子,是有遗憾的事情要告诉我,我保持沉默,微微低下头,"
                    "看着蚂蚁搬运着食物.在我们影子下的蚂蚁很快就离开了影.");
  _Repeatedly_puts_(3000, 1, "忠胜:明年我就要走了.",
                    "我愣住,想了想现在的时间,抬头看向他时,他也在看着我.",
                    "||你要去哪儿?");
  _Repeatedly_puts_(2000, 1, "我的声音很无力,希望他听得清我说了什么",
                    "忠胜:很远的地方...是外域", "是加入反抗军,没错了...");
  _Repeatedly_puts_(
      5000, 1,
      "中午,我在教室,隔着窗户看到蔚蓝天空下,远处的绿色森林."
      "同学在树林的小路玩捉迷藏,他们快乐的样子让我扬起嘴角",
      "忠胜从后面走过来,见我课桌前的座位没人,便坐了上去,他转过身递给我一张纸,"
      "是地图.",
      "他展开地图,地图上标有很多标记,忠胜指着边上的标记并告诉我,这是外域...");
  _Repeatedly_puts_(5000, 1,
                    "放学后,我跟着忠胜走在小巷,他告诉我,明天学校有实战练习,"
                    "由于我是转来的,所以不了解详细内容",
                    "夜晚,忠胜在床上给我讲解着实战练习过程...",
                    "忠胜:实战的战斗环境在校园东边的森林,从上午9点开始,"
                    "到第二天上午9点结束,持续24小时.中途可自愿退出");
  _Repeatedly_puts_(2000, 1, "||:练习的目标是什么?",
                    "忠胜:很简单,在森林里取得被隐藏的三卷图纸,"
                    "只有将完整的三卷图纸提交到森林最高的山峰,才算结束.",
                    "忠胜:过程中避免不了战斗,为了取得优势,大家会组队进行."
                    "按照规定,每组队伍不得超过3个人.");
  _Repeatedly_puts_(3000, 1,
                    "我仔细听完忠胜的话,他参与过很多次练习.记起中午,"
                    "忠胜是战绩不错,被父母拉去加入暗影军团",
                    "我想,在这样的练习中成绩不错的,都会被参与外域的战争吧...",
                    "||应该会受伤吧?");
  _Repeatedly_puts_(2000, 1, "忠胜:你不会没有看学校发的通告吧?",
                    "||已经看过了,无责声明?",
                    "参与实战的成员可能存在生命危险...");
  _Repeatedly_puts_(3000, 1, "夜晚,我睡在忠胜身边,他的体温融化了我的心脏,在",
                    "", "");

  _logEvent_("function.EP0_friend011 return 0");
}
void EP0_friend012(void) {}
